0.0%┣                                           ┫ 0/30.0k [00:00<-25:00, -0s/it]
[1AΔETS: 3296.318 -- Δproduct: 3817.254  0.0%┣  ┫ 1/30.0k [00:07<Inf:Inf, InfGs/it]
[1AΔETS: 2335.087 -- Δproduct: 3817.234  0.0%┣    ┫ 2/30.0k [00:08<67:25:19, 8s/it]
[1AΔETS: 1383.971 -- Δproduct: 3811.981  0.0%┣    ┫ 3/30.0k [00:09<35:57:03, 4s/it]
[1AΔETS: 485.799 -- Δproduct: 3784.300  0.0%┣     ┫ 4/30.0k [00:09<25:31:35, 3s/it]
[1AΔETS: 223.765 -- Δproduct: 3446.616  0.0%┣     ┫ 5/30.0k [00:10<21:04:09, 3s/it]
[1AΔETS: 394.163 -- Δproduct: 2771.422  0.0%┣     ┫ 6/30.0k [00:11<17:41:18, 2s/it]
[1AΔETS: 384.001 -- Δproduct: 2088.049  0.0%┣     ┫ 7/30.0k [00:11<15:36:13, 2s/it]
[1AΔETS: 344.792 -- Δproduct: 1620.599  0.0%┣     ┫ 8/30.0k [00:12<14:06:57, 2s/it]
[1AΔETS: 304.969 -- Δproduct: 1368.428  0.0%┣     ┫ 9/30.0k [00:13<13:05:08, 2s/it]
[1AΔETS: 261.620 -- Δproduct: 1199.871  0.0%┣    ┫ 10/30.0k [00:13<12:15:38, 1s/it]
[1AΔETS: 197.889 -- Δproduct: 1003.648  0.0%┣    ┫ 11/30.0k [00:14<11:45:54, 1s/it]
[1AΔETS: 146.002 -- Δproduct: 826.427  0.0%┣     ┫ 12/30.0k [00:15<11:27:06, 1s/it]
[1AΔETS: 109.247 -- Δproduct: 617.579  0.0%┣     ┫ 13/30.0k [00:16<11:08:55, 1s/it]
[1AΔETS: 80.854 -- Δproduct: 435.280  0.0%┣      ┫ 14/30.0k [00:17<10:49:41, 1s/it]
[1AΔETS: 59.481 -- Δproduct: 381.231  0.1%┣      ┫ 15/30.0k [00:18<10:37:21, 1s/it]
[1AΔETS: 44.592 -- Δproduct: 406.725  0.1%┣      ┫ 16/30.0k [00:19<10:19:18, 1s/it]
[1AΔETS: 34.641 -- Δproduct: 444.297  0.1%┣      ┫ 17/30.0k [00:20<10:14:26, 1s/it]
[1AΔETS: 27.599 -- Δproduct: 499.328  0.1%┣      ┫ 18/30.0k [00:21<10:06:07, 1s/it]
[1AΔETS: 20.749 -- Δproduct: 576.851  0.1%┣      ┫ 19/30.0k [00:21<09:50:41, 1s/it]
[1AΔETS: 15.470 -- Δproduct: 601.349  0.1%┣      ┫ 20/30.0k [00:22<09:43:28, 1s/it]
[1AΔETS: 11.672 -- Δproduct: 565.703  0.1%┣      ┫ 21/30.0k [00:23<09:32:03, 1s/it]
[1AΔETS: 8.992 -- Δproduct: 484.659  0.1%┣       ┫ 22/30.0k [00:24<09:23:58, 1s/it]
[1AΔETS: 7.015 -- Δproduct: 375.907  0.1%┣       ┫ 23/30.0k [00:24<09:13:40, 1s/it]
[1AΔETS: 5.619 -- Δproduct: 258.567  0.1%┣       ┫ 24/30.0k [00:25<09:08:41, 1s/it]
[1AΔETS: 4.640 -- Δproduct: 142.786  0.1%┣       ┫ 25/30.0k [00:26<09:03:12, 1s/it]
[1AΔETS: 3.875 -- Δproduct: 66.230  0.1%┣        ┫ 26/30.0k [00:27<08:57:07, 1s/it]
[1AΔETS: 3.164 -- Δproduct: 104.021  0.1%┣       ┫ 27/30.0k [00:28<08:59:58, 1s/it]
[1AΔETS: 2.484 -- Δproduct: 168.927  0.1%┣       ┫ 28/30.0k [00:29<08:58:36, 1s/it]
[1AΔETS: 1.923 -- Δproduct: 207.888  0.1%┣       ┫ 29/30.0k [00:30<08:51:04, 1s/it]
[1AΔETS: 1.627 -- Δproduct: 219.202  0.1%┣       ┫ 30/30.0k [00:30<08:44:26, 1s/it]
[1AΔETS: 1.469 -- Δproduct: 203.209  0.1%┣       ┫ 31/30.0k [00:31<08:38:54, 1s/it]
[1AΔETS: 1.375 -- Δproduct: 170.310  0.1%┣       ┫ 32/30.0k [00:32<08:35:44, 1s/it]
[1AΔETS: 1.403 -- Δproduct: 127.294  0.1%┣       ┫ 33/30.0k [00:33<08:30:42, 1s/it]
[1AΔETS: 1.515 -- Δproduct: 80.660  0.1%┣        ┫ 34/30.0k [00:34<08:27:05, 1s/it]
[1AΔETS: 1.630 -- Δproduct: 35.223  0.1%┣        ┫ 35/30.0k [00:34<08:24:43, 1s/it]
[1AΔETS: 1.731 -- Δproduct: 24.987  0.1%┣        ┫ 36/30.0k [00:35<08:19:10, 1it/s]
[1AΔETS: 1.835 -- Δproduct: 58.276  0.1%┣        ┫ 37/30.0k [00:36<08:15:04, 1it/s]
[1AΔETS: 1.840 -- Δproduct: 86.892  0.1%┣        ┫ 38/30.0k [00:36<08:11:43, 1it/s]
[1AΔETS: 1.717 -- Δproduct: 101.859  0.1%┣       ┫ 39/30.0k [00:37<08:11:00, 1it/s]
[1AΔETS: 1.598 -- Δproduct: 104.033  0.1%┣       ┫ 40/30.0k [00:38<08:08:35, 1it/s]
[1AΔETS: 1.508 -- Δproduct: 95.848  0.1%┣        ┫ 41/30.0k [00:39<08:05:59, 1it/s]
[1AΔETS: 1.566 -- Δproduct: 79.913  0.1%┣        ┫ 42/30.0k [00:40<08:03:38, 1it/s]
[1AΔETS: 1.705 -- Δproduct: 59.415  0.1%┣        ┫ 43/30.0k [00:41<08:02:25, 1it/s]
[1AΔETS: 1.814 -- Δproduct: 38.074  0.1%┣        ┫ 44/30.0k [00:42<08:02:18, 1it/s]
[1AΔETS: 1.825 -- Δproduct: 19.163  0.1%┣        ┫ 45/30.0k [00:42<07:59:27, 1it/s]
[1AΔETS: 1.818 -- Δproduct: 16.506  0.2%┣        ┫ 46/30.0k [00:43<07:56:35, 1it/s]
[1AΔETS: 1.823 -- Δproduct: 29.877  0.2%┣        ┫ 47/30.0k [00:44<07:55:19, 1it/s]
[1AΔETS: 1.754 -- Δproduct: 42.697  0.2%┣        ┫ 48/30.0k [00:45<07:53:20, 1it/s]
[1AΔETS: 1.651 -- Δproduct: 49.873  0.2%┣        ┫ 49/30.0k [00:45<07:51:16, 1it/s]
[1AΔETS: 1.640 -- Δproduct: 51.056  0.2%┣        ┫ 50/30.0k [00:46<07:50:50, 1it/s]
[1AΔETS: 1.698 -- Δproduct: 47.852  0.2%┣        ┫ 51/30.0k [00:47<07:48:33, 1it/s]
[1AΔETS: 1.753 -- Δproduct: 42.534  0.2%┣        ┫ 52/30.0k [00:48<07:47:25, 1it/s]
[1AΔETS: 1.776 -- Δproduct: 37.296  0.2%┣        ┫ 53/30.0k [00:49<07:46:47, 1it/s]
[1AΔETS: 1.797 -- Δproduct: 34.298  0.2%┣        ┫ 54/30.0k [00:49<07:44:47, 1it/s]
[1AΔETS: 1.743 -- Δproduct: 34.670  0.2%┣        ┫ 55/30.0k [00:50<07:44:33, 1it/s]
[1AΔETS: 1.606 -- Δproduct: 37.147  0.2%┣        ┫ 56/30.0k [00:51<07:45:29, 1it/s]
[1AΔETS: 1.482 -- Δproduct: 40.177  0.2%┣        ┫ 57/30.0k [00:52<07:45:15, 1it/s]
[1AΔETS: 1.434 -- Δproduct: 42.866  0.2%┣        ┫ 58/30.0k [00:53<07:45:40, 1it/s]
[1AΔETS: 1.519 -- Δproduct: 44.854  0.2%┣        ┫ 59/30.0k [00:54<07:43:59, 1it/s]
[1AΔETS: 1.629 -- Δproduct: 45.592  0.2%┣        ┫ 60/30.0k [00:55<07:41:47, 1it/s]
[1AΔETS: 1.712 -- Δproduct: 45.238  0.2%┣        ┫ 61/30.0k [00:55<07:40:16, 1it/s]
[1AΔETS: 1.730 -- Δproduct: 44.189  0.2%┣        ┫ 62/30.0k [00:56<07:37:59, 1it/s]
[1AΔETS: 1.717 -- Δproduct: 42.803  0.2%┣        ┫ 63/30.0k [00:57<07:37:37, 1it/s]
[1AΔETS: 1.737 -- Δproduct: 40.962  0.2%┣        ┫ 64/30.0k [00:58<07:38:13, 1it/s]
[1AΔETS: 1.766 -- Δproduct: 38.361  0.2%┣        ┫ 65/30.0k [00:59<07:38:06, 1it/s]
[1AΔETS: 1.842 -- Δproduct: 35.412  0.2%┣        ┫ 66/30.0k [00:59<07:36:25, 1it/s]
[1AΔETS: 1.851 -- Δproduct: 32.116  0.2%┣        ┫ 67/30.0k [01:00<07:34:55, 1it/s]
[1AΔETS: 1.790 -- Δproduct: 28.748  0.2%┣        ┫ 68/30.0k [01:01<07:34:31, 1it/s]
[1AΔETS: 1.760 -- Δproduct: 26.299  0.2%┣        ┫ 69/30.0k [01:02<07:34:40, 1it/s]
[1AΔETS: 1.829 -- Δproduct: 25.028  0.2%┣        ┫ 70/30.0k [01:03<07:33:56, 1it/s]
[1AΔETS: 1.888 -- Δproduct: 24.463  0.2%┣        ┫ 71/30.0k [01:04<07:33:00, 1it/s]
[1AΔETS: 1.899 -- Δproduct: 24.392  0.2%┣        ┫ 72/30.0k [01:04<07:30:02, 1it/s]
[1AΔETS: 1.898 -- Δproduct: 24.410  0.2%┣        ┫ 73/30.0k [01:05<07:30:03, 1it/s]
[1AΔETS: 1.871 -- Δproduct: 23.361  0.2%┣        ┫ 74/30.0k [01:06<07:29:02, 1it/s]
[1AΔETS: 1.805 -- Δproduct: 21.489  0.2%┣        ┫ 75/30.0k [01:08<07:35:39, 1it/s]
[1AΔETS: 1.721 -- Δproduct: 19.462  0.3%┣        ┫ 76/30.0k [01:08<07:34:35, 1it/s]
[1AΔETS: 1.624 -- Δproduct: 17.652  0.3%┣        ┫ 77/30.0k [01:09<07:33:32, 1it/s]
[1AΔETS: 1.509 -- Δproduct: 16.544  0.3%┣        ┫ 78/30.0k [01:10<07:33:29, 1it/s]
[1AΔETS: 1.415 -- Δproduct: 16.215  0.3%┣        ┫ 79/30.0k [01:11<07:32:22, 1it/s]
[1AΔETS: 1.330 -- Δproduct: 16.021  0.3%┣        ┫ 80/30.0k [01:12<07:31:41, 1it/s]
[1AΔETS: 1.264 -- Δproduct: 15.463  0.3%┣        ┫ 81/30.0k [01:12<07:31:45, 1it/s]
[1AΔETS: 1.223 -- Δproduct: 15.292  0.3%┣        ┫ 82/30.0k [01:13<07:31:30, 1it/s]
[1AΔETS: 1.240 -- Δproduct: 15.462  0.3%┣        ┫ 83/30.0k [01:14<07:31:08, 1it/s]
[1AΔETS: 1.269 -- Δproduct: 15.583  0.3%┣        ┫ 84/30.0k [01:15<07:29:38, 1it/s]
[1AΔETS: 1.287 -- Δproduct: 15.537  0.3%┣        ┫ 85/30.0k [01:16<07:30:39, 1it/s]
[1AΔETS: 1.316 -- Δproduct: 15.296  0.3%┣        ┫ 86/30.0k [01:17<07:29:01, 1it/s]
[1AΔETS: 1.334 -- Δproduct: 15.110  0.3%┣        ┫ 87/30.0k [01:17<07:28:49, 1it/s]
[1AΔETS: 1.296 -- Δproduct: 15.021  0.3%┣        ┫ 88/30.0k [01:18<07:29:00, 1it/s]
[1AΔETS: 1.254 -- Δproduct: 15.076  0.3%┣        ┫ 89/30.0k [01:19<07:28:19, 1it/s]
[1AΔETS: 1.230 -- Δproduct: 15.061  0.3%┣        ┫ 90/30.0k [01:20<07:28:12, 1it/s]
[1AΔETS: 1.184 -- Δproduct: 14.905  0.3%┣        ┫ 91/30.0k [01:21<07:27:10, 1it/s]
[1AΔETS: 1.106 -- Δproduct: 14.463  0.3%┣        ┫ 92/30.0k [01:22<07:26:54, 1it/s]
[1AΔETS: 0.989 -- Δproduct: 13.689  0.3%┣        ┫ 93/30.0k [01:22<07:26:29, 1it/s]
[1AΔETS: 0.864 -- Δproduct: 12.807  0.3%┣        ┫ 94/30.0k [01:23<07:25:36, 1it/s]
[1AΔETS: 0.795 -- Δproduct: 12.087  0.3%┣        ┫ 95/30.0k [01:24<07:25:13, 1it/s]
[1AΔETS: 0.817 -- Δproduct: 11.446  0.3%┣        ┫ 96/30.0k [01:25<07:25:33, 1it/s]
[1AΔETS: 0.910 -- Δproduct: 10.795  0.3%┣        ┫ 97/30.0k [01:26<07:26:22, 1it/s]
[1AΔETS: 1.023 -- Δproduct: 10.127  0.3%┣        ┫ 98/30.0k [01:27<07:25:34, 1it/s]
[1AΔETS: 1.104 -- Δproduct: 9.507  0.3%┣         ┫ 99/30.0k [01:27<07:24:48, 1it/s]
[1AΔETS: 1.117 -- Δproduct: 9.201  0.3%┣        ┫ 100/30.0k [01:28<07:24:15, 1it/s]
[1AΔETS: 1.103 -- Δproduct: 9.194  0.3%┣        ┫ 101/30.0k [01:29<07:24:17, 1it/s]
[1AΔETS: 1.031 -- Δproduct: 9.489  0.3%┣        ┫ 102/30.0k [01:30<07:22:48, 1it/s]
[1AΔETS: 0.921 -- Δproduct: 9.850  0.3%┣        ┫ 103/30.0k [01:31<07:23:06, 1it/s]
[1AΔETS: 0.869 -- Δproduct: 10.031  0.3%┣       ┫ 104/30.0k [01:31<07:21:34, 1it/s]
[1AΔETS: 0.856 -- Δproduct: 10.075  0.4%┣       ┫ 105/30.0k [01:32<07:20:17, 1it/s]
[1AΔETS: 0.850 -- Δproduct: 9.959  0.4%┣        ┫ 106/30.0k [01:33<07:19:36, 1it/s]
[1AΔETS: 0.868 -- Δproduct: 9.738  0.4%┣        ┫ 107/30.0k [01:33<07:19:15, 1it/s]
[1AΔETS: 0.901 -- Δproduct: 9.499  0.4%┣        ┫ 108/30.0k [01:34<07:18:50, 1it/s]
[1AΔETS: 0.941 -- Δproduct: 9.229  0.4%┣        ┫ 109/30.0k [01:35<07:19:14, 1it/s]
[1AΔETS: 0.949 -- Δproduct: 8.937  0.4%┣        ┫ 110/30.0k [01:36<07:18:43, 1it/s]
[1AΔETS: 0.923 -- Δproduct: 8.534  0.4%┣        ┫ 111/30.0k [01:37<07:18:43, 1it/s]
[1AΔETS: 0.904 -- Δproduct: 7.952  0.4%┣        ┫ 112/30.0k [01:38<07:17:46, 1it/s]
[1AΔETS: 0.853 -- Δproduct: 7.237  0.4%┣        ┫ 113/30.0k [01:39<07:18:06, 1it/s]
[1AΔETS: 0.813 -- Δproduct: 6.430  0.4%┣        ┫ 114/30.0k [01:39<07:18:01, 1it/s]
[1AΔETS: 0.812 -- Δproduct: 5.668  0.4%┣        ┫ 115/30.0k [01:40<07:17:38, 1it/s]
[1AΔETS: 0.807 -- Δproduct: 5.166  0.4%┣        ┫ 116/30.0k [01:41<07:16:41, 1it/s]
[1AΔETS: 0.809 -- Δproduct: 4.934  0.4%┣        ┫ 117/30.0k [01:42<07:16:08, 1it/s]
[1AΔETS: 0.813 -- Δproduct: 4.874  0.4%┣        ┫ 118/30.0k [01:42<07:15:58, 1it/s]
[1AΔETS: 0.847 -- Δproduct: 4.901  0.4%┣        ┫ 119/30.0k [01:43<07:16:28, 1it/s]
[1AΔETS: 0.870 -- Δproduct: 5.082  0.4%┣        ┫ 120/30.0k [01:44<07:15:27, 1it/s]
[1AΔETS: 0.955 -- Δproduct: 5.345  0.4%┣        ┫ 121/30.0k [01:45<07:16:22, 1it/s]
[1AΔETS: 1.004 -- Δproduct: 5.605  0.4%┣        ┫ 122/30.0k [01:46<07:16:30, 1it/s]
[1AΔETS: 1.002 -- Δproduct: 5.821  0.4%┣        ┫ 123/30.0k [01:48<07:19:03, 1it/s]
[1AΔETS: 1.031 -- Δproduct: 6.064  0.4%┣        ┫ 124/30.0k [01:48<07:18:40, 1it/s]
[1AΔETS: 1.074 -- Δproduct: 6.284  0.4%┣        ┫ 125/30.0k [01:49<07:18:54, 1it/s]
[1AΔETS: 1.140 -- Δproduct: 6.447  0.4%┣        ┫ 126/30.0k [01:50<07:18:41, 1it/s]
[1AΔETS: 1.201 -- Δproduct: 6.602  0.4%┣        ┫ 127/30.0k [01:51<07:18:32, 1it/s]
[1AΔETS: 1.230 -- Δproduct: 6.659  0.4%┣        ┫ 128/30.0k [01:52<07:17:42, 1it/s]
[1AΔETS: 1.235 -- Δproduct: 6.629  0.4%┣        ┫ 129/30.0k [01:52<07:17:09, 1it/s]
[1AΔETS: 1.220 -- Δproduct: 6.665  0.4%┣        ┫ 130/30.0k [01:53<07:16:50, 1it/s]
[1AΔETS: 1.180 -- Δproduct: 6.803  0.4%┣        ┫ 131/30.0k [01:54<07:15:58, 1it/s]
[1AΔETS: 1.135 -- Δproduct: 6.999  0.4%┣        ┫ 132/30.0k [01:55<07:16:49, 1it/s]
[1AΔETS: 1.096 -- Δproduct: 7.199  0.4%┣        ┫ 133/30.0k [01:56<07:16:30, 1it/s]
[1AΔETS: 1.047 -- Δproduct: 7.392  0.4%┣        ┫ 134/30.0k [01:57<07:16:21, 1it/s]
[1AΔETS: 0.997 -- Δproduct: 7.518  0.4%┣        ┫ 135/30.0k [01:58<07:16:36, 1it/s]
[1AΔETS: 0.957 -- Δproduct: 7.547  0.5%┣        ┫ 136/30.0k [01:58<07:15:56, 1it/s]
[1AΔETS: 0.920 -- Δproduct: 7.503  0.5%┣        ┫ 137/30.0k [01:59<07:15:36, 1it/s]
[1AΔETS: 0.874 -- Δproduct: 7.409  0.5%┣        ┫ 138/30.0k [02:00<07:15:11, 1it/s]
[1AΔETS: 0.811 -- Δproduct: 7.312  0.5%┣        ┫ 139/30.0k [02:00<07:14:09, 1it/s]
[1AΔETS: 0.738 -- Δproduct: 7.181  0.5%┣        ┫ 140/30.0k [02:01<07:13:43, 1it/s]
[1AΔETS: 0.670 -- Δproduct: 7.090  0.5%┣        ┫ 141/30.0k [02:02<07:14:15, 1it/s]
[1AΔETS: 0.611 -- Δproduct: 7.095  0.5%┣        ┫ 142/30.0k [02:03<07:13:41, 1it/s]
[1AΔETS: 0.557 -- Δproduct: 7.175  0.5%┣        ┫ 143/30.0k [02:04<07:14:26, 1it/s]
[1AΔETS: 0.512 -- Δproduct: 7.263  0.5%┣        ┫ 144/30.0k [02:05<07:15:12, 1it/s]
[1AΔETS: 0.470 -- Δproduct: 7.278  0.5%┣        ┫ 145/30.0k [02:06<07:15:00, 1it/s]
[1AΔETS: 0.433 -- Δproduct: 7.177  0.5%┣        ┫ 146/30.0k [02:07<07:14:38, 1it/s]
[1AΔETS: 0.405 -- Δproduct: 7.024  0.5%┣        ┫ 147/30.0k [02:08<07:14:35, 1it/s]
[1AΔETS: 0.381 -- Δproduct: 6.900  0.5%┣        ┫ 148/30.0k [02:08<07:14:46, 1it/s]
[1AΔETS: 0.356 -- Δproduct: 6.851  0.5%┣        ┫ 149/30.0k [02:10<07:15:37, 1it/s]
[1AΔETS: 0.343 -- Δproduct: 6.733  0.5%┣        ┫ 150/30.0k [02:10<07:14:54, 1it/s]
[1AΔETS: 0.338 -- Δproduct: 6.679  0.5%┣        ┫ 151/30.0k [02:11<07:15:19, 1it/s]
[1AΔETS: 0.331 -- Δproduct: 6.664  0.5%┣        ┫ 152/30.0k [02:12<07:15:45, 1it/s]
[1AΔETS: 0.318 -- Δproduct: 6.696  0.5%┣        ┫ 153/30.0k [02:13<07:16:03, 1it/s]
[1AΔETS: 0.298 -- Δproduct: 6.693  0.5%┣        ┫ 154/30.0k [02:14<07:15:45, 1it/s]
[1AΔETS: 0.278 -- Δproduct: 6.659  0.5%┣        ┫ 155/30.0k [02:15<07:15:51, 1it/s]
[1AΔETS: 0.259 -- Δproduct: 6.597  0.5%┣        ┫ 156/30.0k [02:16<07:15:18, 1it/s]
[1AΔETS: 0.250 -- Δproduct: 6.452  0.5%┣        ┫ 157/30.0k [02:16<07:14:34, 1it/s]
[1AΔETS: 0.245 -- Δproduct: 6.172  0.5%┣        ┫ 158/30.0k [02:17<07:14:23, 1it/s]
[1AΔETS: 0.244 -- Δproduct: 5.669  0.5%┣        ┫ 159/30.0k [02:18<07:14:25, 1it/s]
[1AΔETS: 0.241 -- Δproduct: 5.040  0.5%┣        ┫ 160/30.0k [02:19<07:14:42, 1it/s]
[1AΔETS: 0.227 -- Δproduct: 4.397  0.5%┣        ┫ 161/30.0k [02:20<07:14:05, 1it/s]
[1AΔETS: 0.206 -- Δproduct: 3.843  0.5%┣        ┫ 162/30.0k [02:20<07:13:41, 1it/s]
[1AΔETS: 0.186 -- Δproduct: 3.444  0.5%┣        ┫ 163/30.0k [02:21<07:13:27, 1it/s]
[1AΔETS: 0.174 -- Δproduct: 3.239  0.5%┣        ┫ 164/30.0k [02:22<07:12:50, 1it/s]
[1AΔETS: 0.178 -- Δproduct: 3.151  0.5%┣        ┫ 165/30.0k [02:23<07:12:27, 1it/s]
[1AΔETS: 0.174 -- Δproduct: 3.202  0.6%┣        ┫ 166/30.0k [02:24<07:13:11, 1it/s]
[1AΔETS: 0.171 -- Δproduct: 3.400  0.6%┣        ┫ 167/30.0k [02:25<07:12:58, 1it/s]
[1AΔETS: 0.174 -- Δproduct: 3.639  0.6%┣        ┫ 168/30.0k [02:25<07:12:30, 1it/s]
[1AΔETS: 0.176 -- Δproduct: 3.837  0.6%┣        ┫ 169/30.0k [02:26<07:11:54, 1it/s]
[1AΔETS: 0.178 -- Δproduct: 3.959  0.6%┣        ┫ 170/30.0k [02:27<07:12:17, 1it/s]
[1AΔETS: 0.176 -- Δproduct: 4.001  0.6%┣        ┫ 171/30.0k [02:28<07:11:41, 1it/s]
[1AΔETS: 0.170 -- Δproduct: 3.980  0.6%┣        ┫ 172/30.0k [02:28<07:11:07, 1it/s]
[1AΔETS: 0.164 -- Δproduct: 3.910  0.6%┣        ┫ 173/30.0k [02:29<07:10:58, 1it/s]
[1AΔETS: 0.171 -- Δproduct: 3.804  0.6%┣        ┫ 174/30.0k [02:30<07:10:58, 1it/s]
[1AΔETS: 0.176 -- Δproduct: 3.687  0.6%┣        ┫ 175/30.0k [02:31<07:10:21, 1it/s]
[1AΔETS: 0.171 -- Δproduct: 3.564  0.6%┣        ┫ 176/30.0k [02:32<07:10:32, 1it/s]
[1AΔETS: 0.159 -- Δproduct: 3.445  0.6%┣        ┫ 177/30.0k [02:32<07:10:16, 1it/s]
[1AΔETS: 0.150 -- Δproduct: 3.335  0.6%┣        ┫ 178/30.0k [02:33<07:10:28, 1it/s]
[1AΔETS: 0.150 -- Δproduct: 3.251  0.6%┣        ┫ 179/30.0k [02:34<07:09:58, 1it/s]
[1AΔETS: 0.154 -- Δproduct: 3.243  0.6%┣        ┫ 180/30.0k [02:35<07:09:41, 1it/s]
[1AΔETS: 0.155 -- Δproduct: 3.320  0.6%┣        ┫ 181/30.0k [02:36<07:09:25, 1it/s]
[1AΔETS: 0.156 -- Δproduct: 3.474  0.6%┣        ┫ 182/30.0k [02:36<07:09:20, 1it/s]
[1AΔETS: 0.154 -- Δproduct: 3.738  0.6%┣        ┫ 183/30.0k [02:37<07:09:18, 1it/s]
[1AΔETS: 0.156 -- Δproduct: 4.015  0.6%┣        ┫ 184/30.0k [02:38<07:09:18, 1it/s]
[1AΔETS: 0.160 -- Δproduct: 4.250  0.6%┣        ┫ 185/30.0k [02:39<07:09:19, 1it/s]
[1AΔETS: 0.161 -- Δproduct: 4.415  0.6%┣        ┫ 186/30.0k [02:40<07:08:35, 1it/s]
[1AΔETS: 0.158 -- Δproduct: 4.483  0.6%┣        ┫ 187/30.0k [02:40<07:08:33, 1it/s]
[1AΔETS: 0.155 -- Δproduct: 4.469  0.6%┣        ┫ 188/30.0k [02:41<07:08:22, 1it/s]
[1AΔETS: 0.155 -- Δproduct: 4.416  0.6%┣        ┫ 189/30.0k [02:42<07:08:17, 1it/s]
[1AΔETS: 0.157 -- Δproduct: 4.370  0.6%┣        ┫ 190/30.0k [02:43<07:07:21, 1it/s]
[1AΔETS: 0.157 -- Δproduct: 4.294  0.6%┣        ┫ 191/30.0k [02:43<07:06:41, 1it/s]
[1AΔETS: 0.153 -- Δproduct: 4.159  0.6%┣        ┫ 192/30.0k [02:44<07:06:15, 1it/s]
[1AΔETS: 0.147 -- Δproduct: 3.977  0.6%┣        ┫ 193/30.0k [02:45<07:05:59, 1it/s]
[1AΔETS: 0.143 -- Δproduct: 3.772  0.6%┣        ┫ 194/30.0k [02:45<07:05:46, 1it/s]
[1AΔETS: 0.138 -- Δproduct: 3.541  0.7%┣        ┫ 195/30.0k [02:46<07:05:46, 1it/s]
[1AΔETS: 0.131 -- Δproduct: 3.312  0.7%┣        ┫ 196/30.0k [02:47<07:05:45, 1it/s]
[1AΔETS: 0.123 -- Δproduct: 3.101  0.7%┣        ┫ 197/30.0k [02:48<07:05:20, 1it/s]
[1AΔETS: 0.118 -- Δproduct: 2.914  0.7%┣        ┫ 198/30.0k [02:49<07:05:41, 1it/s]
[1AΔETS: 0.115 -- Δproduct: 2.767  0.7%┣        ┫ 199/30.0k [02:50<07:05:53, 1it/s]
[1AΔETS: 0.112 -- Δproduct: 2.662  0.7%┣        ┫ 200/30.0k [02:50<07:05:01, 1it/s]
[1AΔETS: 0.113 -- Δproduct: 2.609  0.7%┣        ┫ 201/30.0k [02:51<07:04:38, 1it/s]
[1AΔETS: 0.112 -- Δproduct: 2.607  0.7%┣        ┫ 202/30.0k [02:52<07:04:31, 1it/s]
[1AΔETS: 0.111 -- Δproduct: 2.663  0.7%┣        ┫ 203/30.0k [02:52<07:04:01, 1it/s]
[1AΔETS: 0.113 -- Δproduct: 2.735  0.7%┣        ┫ 204/30.0k [02:53<07:03:47, 1it/s]
[1AΔETS: 0.115 -- Δproduct: 2.812  0.7%┣        ┫ 205/30.0k [02:54<07:03:14, 1it/s]
[1AΔETS: 0.115 -- Δproduct: 2.887  0.7%┣        ┫ 206/30.0k [02:55<07:03:19, 1it/s]
[1AΔETS: 0.114 -- Δproduct: 2.947  0.7%┣        ┫ 207/30.0k [02:55<07:02:40, 1it/s]
[1AΔETS: 0.112 -- Δproduct: 2.981  0.7%┣        ┫ 208/30.0k [02:56<07:03:20, 1it/s]
[1AΔETS: 0.109 -- Δproduct: 2.978  0.7%┣        ┫ 209/30.0k [02:57<07:03:32, 1it/s]
[1AΔETS: 0.107 -- Δproduct: 2.935  0.7%┣        ┫ 210/30.0k [02:58<07:03:03, 1it/s]
[1AΔETS: 0.104 -- Δproduct: 2.848  0.7%┣        ┫ 211/30.0k [02:59<07:02:54, 1it/s]
[1AΔETS: 0.098 -- Δproduct: 2.659  0.7%┣        ┫ 212/30.0k [03:00<07:03:04, 1it/s]
[1AΔETS: 0.089 -- Δproduct: 2.414  0.7%┣        ┫ 213/30.0k [03:01<07:02:43, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 2.173  0.7%┣        ┫ 214/30.0k [03:01<07:02:32, 1it/s]
[1AΔETS: 0.081 -- Δproduct: 1.993  0.7%┣        ┫ 215/30.0k [03:02<07:03:15, 1it/s]
[1AΔETS: 0.080 -- Δproduct: 1.903  0.7%┣        ┫ 216/30.0k [03:03<07:03:21, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 1.889  0.7%┣        ┫ 217/30.0k [03:04<07:03:03, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 1.921  0.7%┣        ┫ 218/30.0k [03:05<07:02:51, 1it/s]
[1AΔETS: 0.085 -- Δproduct: 1.967  0.7%┣        ┫ 219/30.0k [03:06<07:02:43, 1it/s]
[1AΔETS: 0.087 -- Δproduct: 2.010  0.7%┣        ┫ 220/30.0k [03:06<07:02:22, 1it/s]
[1AΔETS: 0.088 -- Δproduct: 2.038  0.7%┣        ┫ 221/30.0k [03:07<07:02:15, 1it/s]
[1AΔETS: 0.087 -- Δproduct: 2.043  0.7%┣        ┫ 222/30.0k [03:08<07:01:53, 1it/s]
[1AΔETS: 0.084 -- Δproduct: 2.016  0.7%┣        ┫ 223/30.0k [03:09<07:02:05, 1it/s]
[1AΔETS: 0.080 -- Δproduct: 1.978  0.7%┣        ┫ 224/30.0k [03:10<07:02:12, 1it/s]
[1AΔETS: 0.077 -- Δproduct: 1.937  0.8%┣        ┫ 225/30.0k [03:10<07:01:48, 1it/s]
[1AΔETS: 0.076 -- Δproduct: 1.913  0.8%┣        ┫ 226/30.0k [03:11<07:01:18, 1it/s]
[1AΔETS: 0.078 -- Δproduct: 1.954  0.8%┣        ┫ 227/30.0k [03:12<07:01:21, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 2.073  0.8%┣        ┫ 228/30.0k [03:13<07:00:57, 1it/s]
[1AΔETS: 0.083 -- Δproduct: 2.184  0.8%┣        ┫ 229/30.0k [03:13<07:01:03, 1it/s]
[1AΔETS: 0.081 -- Δproduct: 2.267  0.8%┣        ┫ 230/30.0k [03:14<07:00:45, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 2.362  0.8%┣        ┫ 231/30.0k [03:15<07:00:38, 1it/s]
[1AΔETS: 0.089 -- Δproduct: 2.438  0.8%┣        ┫ 232/30.0k [03:16<07:00:28, 1it/s]
[1AΔETS: 0.095 -- Δproduct: 2.439  0.8%┣        ┫ 233/30.0k [03:17<07:00:26, 1it/s]
[1AΔETS: 0.097 -- Δproduct: 2.383  0.8%┣        ┫ 234/30.0k [03:18<07:00:31, 1it/s]
[1AΔETS: 0.100 -- Δproduct: 2.297  0.8%┣        ┫ 235/30.0k [03:18<07:00:24, 1it/s]
[1AΔETS: 0.102 -- Δproduct: 2.193  0.8%┣        ┫ 236/30.0k [03:19<07:00:37, 1it/s]
[1AΔETS: 0.101 -- Δproduct: 2.084  0.8%┣        ┫ 237/30.0k [03:20<07:00:16, 1it/s]
[1AΔETS: 0.099 -- Δproduct: 1.988  0.8%┣        ┫ 238/30.0k [03:21<07:00:23, 1it/s]
[1AΔETS: 0.102 -- Δproduct: 1.921  0.8%┣        ┫ 239/30.0k [03:22<07:00:33, 1it/s]
[1AΔETS: 0.100 -- Δproduct: 1.888  0.8%┣        ┫ 240/30.0k [03:23<07:00:15, 1it/s]
[1AΔETS: 0.093 -- Δproduct: 1.885  0.8%┣        ┫ 241/30.0k [03:23<07:00:04, 1it/s]
[1AΔETS: 0.085 -- Δproduct: 1.919  0.8%┣        ┫ 242/30.0k [03:24<06:59:54, 1it/s]
[1AΔETS: 0.083 -- Δproduct: 1.962  0.8%┣        ┫ 243/30.0k [03:25<06:59:48, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 1.992  0.8%┣        ┫ 244/30.0k [03:26<06:59:26, 1it/s]
[1AΔETS: 0.078 -- Δproduct: 2.004  0.8%┣        ┫ 245/30.0k [03:26<06:59:17, 1it/s]
[1AΔETS: 0.072 -- Δproduct: 1.993  0.8%┣        ┫ 246/30.0k [03:27<06:59:09, 1it/s]
[1AΔETS: 0.067 -- Δproduct: 1.958  0.8%┣        ┫ 247/30.0k [03:28<06:58:40, 1it/s]
[1AΔETS: 0.064 -- Δproduct: 1.902  0.8%┣        ┫ 248/30.0k [03:29<06:58:57, 1it/s]
[1AΔETS: 0.062 -- Δproduct: 1.803  0.8%┣        ┫ 249/30.0k [03:29<06:58:09, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.650  0.8%┣        ┫ 250/30.0k [03:30<06:57:57, 1it/s]
[1AΔETS: 0.057 -- Δproduct: 1.483  0.8%┣        ┫ 251/30.0k [03:31<06:58:22, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.333  0.8%┣        ┫ 252/30.0k [03:32<06:58:30, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 1.233  0.8%┣        ┫ 253/30.0k [03:33<06:58:23, 1it/s]
[1AΔETS: 0.059 -- Δproduct: 1.198  0.8%┣        ┫ 254/30.0k [03:34<06:59:11, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.201  0.9%┣        ┫ 255/30.0k [03:35<06:59:54, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.210  0.9%┣        ┫ 256/30.0k [03:36<06:59:41, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.277  0.9%┣        ┫ 257/30.0k [03:37<06:59:35, 1it/s]
[1AΔETS: 0.064 -- Δproduct: 1.419  0.9%┣        ┫ 258/30.0k [03:37<06:59:18, 1it/s]
[1AΔETS: 0.070 -- Δproduct: 1.560  0.9%┣        ┫ 259/30.0k [03:38<06:59:06, 1it/s]
[1AΔETS: 0.078 -- Δproduct: 1.716  0.9%┣        ┫ 260/30.0k [03:39<06:58:49, 1it/s]
[1AΔETS: 0.086 -- Δproduct: 1.877  0.9%┣        ┫ 261/30.0k [03:40<06:59:00, 1it/s]
[1AΔETS: 0.093 -- Δproduct: 1.996  0.9%┣        ┫ 262/30.0k [03:40<06:58:43, 1it/s]
[1AΔETS: 0.099 -- Δproduct: 2.062  0.9%┣        ┫ 263/30.0k [03:41<06:58:12, 1it/s]
[1AΔETS: 0.099 -- Δproduct: 2.077  0.9%┣        ┫ 264/30.0k [03:42<06:57:52, 1it/s]
[1AΔETS: 0.096 -- Δproduct: 2.054  0.9%┣        ┫ 265/30.0k [03:42<06:57:37, 1it/s]
[1AΔETS: 0.092 -- Δproduct: 2.003  0.9%┣        ┫ 266/30.0k [03:43<06:57:28, 1it/s]
[1AΔETS: 0.087 -- Δproduct: 1.932  0.9%┣        ┫ 267/30.0k [03:44<06:57:02, 1it/s]
[1AΔETS: 0.085 -- Δproduct: 1.854  0.9%┣        ┫ 268/30.0k [03:45<06:57:08, 1it/s]
[1AΔETS: 0.082 -- Δproduct: 1.770  0.9%┣        ┫ 269/30.0k [03:46<06:57:21, 1it/s]
[1AΔETS: 0.077 -- Δproduct: 1.667  0.9%┣        ┫ 270/30.0k [03:47<06:57:19, 1it/s]
[1AΔETS: 0.072 -- Δproduct: 1.539  0.9%┣        ┫ 271/30.0k [03:47<06:57:10, 1it/s]
[1AΔETS: 0.068 -- Δproduct: 1.405  0.9%┣        ┫ 272/30.0k [03:48<06:57:13, 1it/s]
[1AΔETS: 0.067 -- Δproduct: 1.283  0.9%┣        ┫ 273/30.0k [03:49<06:56:58, 1it/s]
[1AΔETS: 0.067 -- Δproduct: 1.183  0.9%┣        ┫ 274/30.0k [03:50<06:56:57, 1it/s]
[1AΔETS: 0.066 -- Δproduct: 1.109  0.9%┣        ┫ 275/30.0k [03:51<06:56:48, 1it/s]
[1AΔETS: 0.064 -- Δproduct: 1.054  0.9%┣        ┫ 276/30.0k [03:51<06:57:00, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.011  0.9%┣        ┫ 277/30.0k [03:52<06:56:39, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 0.971  0.9%┣        ┫ 278/30.0k [03:53<06:56:35, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 0.963  0.9%┣        ┫ 279/30.0k [03:54<06:56:29, 1it/s]
[1AΔETS: 0.059 -- Δproduct: 1.023  0.9%┣        ┫ 280/30.0k [03:55<06:56:23, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.121  0.9%┣        ┫ 281/30.0k [03:55<06:56:12, 1it/s]
[1AΔETS: 0.061 -- Δproduct: 1.235  0.9%┣        ┫ 282/30.0k [03:56<06:56:15, 1it/s]
[1AΔETS: 0.062 -- Δproduct: 1.345  0.9%┣        ┫ 283/30.0k [03:57<06:56:26, 1it/s]
[1AΔETS: 0.063 -- Δproduct: 1.436  0.9%┣        ┫ 284/30.0k [03:58<06:56:19, 1it/s]
[1AΔETS: 0.064 -- Δproduct: 1.504  0.9%┣        ┫ 285/30.0k [03:59<06:56:22, 1it/s]
[1AΔETS: 0.064 -- Δproduct: 1.542  1.0%┣        ┫ 286/30.0k [03:59<06:56:02, 1it/s]
[1AΔETS: 0.065 -- Δproduct: 1.559  1.0%┣        ┫ 287/30.0k [04:00<06:55:47, 1it/s]
[1AΔETS: 0.070 -- Δproduct: 1.613  1.0%┣        ┫ 288/30.0k [04:01<06:55:36, 1it/s]
[1AΔETS: 0.073 -- Δproduct: 1.670  1.0%┣        ┫ 289/30.0k [04:02<06:55:23, 1it/s]
[1AΔETS: 0.076 -- Δproduct: 1.710  1.0%┣        ┫ 290/30.0k [04:02<06:55:19, 1it/s]
[1AΔETS: 0.081 -- Δproduct: 1.783  1.0%┣        ┫ 291/30.0k [04:03<06:55:10, 1it/s]
[1AΔETS: 0.079 -- Δproduct: 1.826  1.0%┣        ┫ 292/30.0k [04:04<06:55:29, 1it/s]
[1AΔETS: 0.075 -- Δproduct: 1.811  1.0%┣        ┫ 293/30.0k [04:05<06:55:21, 1it/s]
[1AΔETS: 0.071 -- Δproduct: 1.743  1.0%┣        ┫ 294/30.0k [04:06<06:55:25, 1it/s]
[1AΔETS: 0.070 -- Δproduct: 1.637  1.0%┣        ┫ 295/30.0k [04:07<06:55:19, 1it/s]
[1AΔETS: 0.069 -- Δproduct: 1.518  1.0%┣        ┫ 296/30.0k [04:08<06:55:23, 1it/s]
[1AΔETS: 0.071 -- Δproduct: 1.426  1.0%┣        ┫ 297/30.0k [04:08<06:55:06, 1it/s]
[1AΔETS: 0.072 -- Δproduct: 1.377  1.0%┣        ┫ 298/30.0k [04:09<06:55:06, 1it/s]
[1AΔETS: 0.070 -- Δproduct: 1.362  1.0%┣        ┫ 299/30.0k [04:10<06:55:15, 1it/s]
[1AΔETS: 0.068 -- Δproduct: 1.360  1.0%┣        ┫ 300/30.0k [04:11<06:55:24, 1it/s]
[1AΔETS: 0.065 -- Δproduct: 1.353  1.0%┣        ┫ 301/30.0k [04:13<06:57:51, 1it/s]
[1AΔETS: 0.061 -- Δproduct: 1.329  1.0%┣        ┫ 302/30.0k [04:14<06:57:51, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 1.287  1.0%┣        ┫ 303/30.0k [04:15<06:57:56, 1it/s]
[1AΔETS: 0.057 -- Δproduct: 1.231  1.0%┣        ┫ 304/30.0k [04:16<06:58:15, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.170  1.0%┣        ┫ 305/30.0k [04:17<06:58:18, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.108  1.0%┣        ┫ 306/30.0k [04:18<06:57:51, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.047  1.0%┣        ┫ 307/30.0k [04:18<06:57:38, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 0.998  1.0%┣        ┫ 308/30.0k [04:19<06:57:31, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 0.964  1.0%┣        ┫ 309/30.0k [04:20<06:57:18, 1it/s]
[1AΔETS: 0.066 -- Δproduct: 0.942  1.0%┣        ┫ 310/30.0k [04:20<06:57:06, 1it/s]
[1AΔETS: 0.074 -- Δproduct: 0.926  1.0%┣        ┫ 311/30.0k [04:21<06:56:52, 1it/s]
[1AΔETS: 0.075 -- Δproduct: 0.918  1.0%┣        ┫ 312/30.0k [04:22<06:56:44, 1it/s]
[1AΔETS: 0.072 -- Δproduct: 0.921  1.0%┣        ┫ 313/30.0k [04:23<06:56:33, 1it/s]
[1AΔETS: 0.067 -- Δproduct: 0.937  1.0%┣        ┫ 314/30.0k [04:23<06:56:29, 1it/s]
[1AΔETS: 0.063 -- Δproduct: 0.982  1.1%┣        ┫ 315/30.0k [04:24<06:56:20, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 1.045  1.1%┣        ┫ 316/30.0k [04:25<06:56:18, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 1.108  1.1%┣        ┫ 317/30.0k [04:26<06:56:28, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.157  1.1%┣        ┫ 318/30.0k [04:27<06:56:15, 1it/s]
[1AΔETS: 0.055 -- Δproduct: 1.186  1.1%┣        ┫ 319/30.0k [04:27<06:56:05, 1it/s]
[1AΔETS: 0.054 -- Δproduct: 1.191  1.1%┣        ┫ 320/30.0k [04:28<06:55:57, 1it/s]
[1AΔETS: 0.054 -- Δproduct: 1.174  1.1%┣        ┫ 321/30.0k [04:29<06:56:00, 1it/s]
[1AΔETS: 0.055 -- Δproduct: 1.134  1.1%┣        ┫ 322/30.0k [04:30<06:56:05, 1it/s]
[1AΔETS: 0.056 -- Δproduct: 1.071  1.1%┣        ┫ 323/30.0k [04:31<06:56:12, 1it/s]
[1AΔETS: 0.055 -- Δproduct: 0.997  1.1%┣        ┫ 324/30.0k [04:32<06:56:23, 1it/s]
[1AΔETS: 0.053 -- Δproduct: 0.924  1.1%┣        ┫ 325/30.0k [04:33<06:56:16, 1it/s]
[1AΔETS: 0.054 -- Δproduct: 0.873  1.1%┣        ┫ 326/30.0k [04:33<06:56:10, 1it/s]
[1AΔETS: 0.057 -- Δproduct: 0.892  1.1%┣        ┫ 327/30.0k [04:34<06:56:11, 1it/s]
[1AΔETS: 0.059 -- Δproduct: 0.929  1.1%┣        ┫ 328/30.0k [04:35<06:56:04, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 0.951  1.1%┣        ┫ 329/30.0k [04:36<06:55:55, 1it/s]
[1AΔETS: 0.060 -- Δproduct: 0.953  1.1%┣        ┫ 330/30.0k [04:37<06:55:44, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 0.947  1.1%┣        ┫ 331/30.0k [04:37<06:55:42, 1it/s]
[1AΔETS: 0.055 -- Δproduct: 0.941  1.1%┣        ┫ 332/30.0k [04:38<06:55:27, 1it/s]
[1AΔETS: 0.053 -- Δproduct: 0.939  1.1%┣        ┫ 333/30.0k [04:39<06:55:38, 1it/s]
[1AΔETS: 0.051 -- Δproduct: 0.937  1.1%┣        ┫ 334/30.0k [04:40<06:55:24, 1it/s]
[1AΔETS: 0.050 -- Δproduct: 0.932  1.1%┣        ┫ 335/30.0k [04:41<06:55:20, 1it/s]
[1AΔETS: 0.049 -- Δproduct: 0.921  1.1%┣        ┫ 336/30.0k [04:42<06:55:53, 1it/s]
[1AΔETS: 0.049 -- Δproduct: 0.899  1.1%┣        ┫ 337/30.0k [04:43<06:56:01, 1it/s]
[1AΔETS: 0.050 -- Δproduct: 0.868  1.1%┣        ┫ 338/30.0k [04:43<06:55:44, 1it/s]
[1AΔETS: 0.049 -- Δproduct: 0.828  1.1%┣        ┫ 339/30.0k [04:44<06:55:40, 1it/s]
[1AΔETS: 0.047 -- Δproduct: 0.784  1.1%┣        ┫ 340/30.0k [04:45<06:56:02, 1it/s]
[1AΔETS: 0.044 -- Δproduct: 0.741  1.1%┣        ┫ 341/30.0k [04:46<06:56:01, 1it/s]
[1AΔETS: 0.040 -- Δproduct: 0.700  1.1%┣        ┫ 342/30.0k [04:47<06:56:00, 1it/s]
[1AΔETS: 0.036 -- Δproduct: 0.665  1.1%┣        ┫ 343/30.0k [04:48<06:56:18, 1it/s]
[1AΔETS: 0.034 -- Δproduct: 0.635  1.1%┣        ┫ 344/30.0k [04:49<06:56:30, 1it/s]
[1AΔETS: 0.033 -- Δproduct: 0.610  1.1%┣        ┫ 345/30.0k [04:50<06:56:34, 1it/s]
[1AΔETS: 0.034 -- Δproduct: 0.590  1.2%┣        ┫ 346/30.0k [04:51<06:56:37, 1it/s]
[1AΔETS: 0.034 -- Δproduct: 0.572  1.2%┣        ┫ 347/30.0k [04:52<06:56:30, 1it/s]
[1AΔETS: 0.033 -- Δproduct: 0.558  1.2%┣        ┫ 348/30.0k [04:52<06:56:10, 1it/s]
[1AΔETS: 0.032 -- Δproduct: 0.546  1.2%┣        ┫ 349/30.0k [04:53<06:56:18, 1it/s]
[1AΔETS: 0.031 -- Δproduct: 0.534  1.2%┣        ┫ 350/30.0k [04:54<06:56:34, 1it/s]
[1AΔETS: 0.036 -- Δproduct: 0.530  1.2%┣        ┫ 351/30.0k [04:55<06:56:48, 1it/s]
[1AΔETS: 0.051 -- Δproduct: 0.533  1.2%┣        ┫ 352/30.0k [04:56<06:56:50, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 0.551  1.2%┣        ┫ 353/30.0k [04:57<06:56:30, 1it/s]
[1AΔETS: 0.058 -- Δproduct: 0.594  1.2%┣        ┫ 354/30.0k [04:57<06:56:23, 1it/s]
[1AΔETS: 0.054 -- Δproduct: 0.661  1.2%┣        ┫ 355/30.0k [04:58<06:56:17, 1it/s]
[1AΔETS: 0.048 -- Δproduct: 0.739  1.2%┣        ┫ 356/30.0k [04:59<06:56:04, 1it/s]
[1AΔETS: 0.043 -- Δproduct: 0.866  1.2%┣        ┫ 357/30.0k [05:00<06:55:52, 1it/s]
[1AΔETS: 0.043 -- Δproduct: 0.866  100.0%┣█████┫ 30.0k/30.0k [05:00<00:00, 100it/s]
0.0%┣                                           ┫ 0/30.0k [00:00<-25:00, -0s/it]
[1AΔETS: 636.093 -- Δproduct: 654.654  0.0%┣    ┫ 1/30.0k [00:01<Inf:Inf, InfGs/it]
[1AΔETS: 462.808 -- Δproduct: 654.673  0.0%┣      ┫ 2/30.0k [00:02<18:17:34, 2s/it]
[1AΔETS: 379.154 -- Δproduct: 654.665  0.0%┣      ┫ 3/30.0k [00:03<13:39:15, 2s/it]
[1AΔETS: 321.665 -- Δproduct: 654.660  0.0%┣      ┫ 4/30.0k [00:04<12:10:20, 1s/it]
[1AΔETS: 275.197 -- Δproduct: 654.656  0.0%┣      ┫ 5/30.0k [00:06<11:27:49, 1s/it]
[1AΔETS: 235.843 -- Δproduct: 654.655  0.0%┣      ┫ 6/30.0k [00:06<10:29:45, 1s/it]
[1AΔETS: 201.692 -- Δproduct: 654.654  0.0%┣      ┫ 7/30.0k [00:07<10:12:26, 1s/it]
[1AΔETS: 171.667 -- Δproduct: 654.654  0.0%┣      ┫ 8/30.0k [00:08<09:53:40, 1s/it]
[1AΔETS: 145.104 -- Δproduct: 654.654  0.0%┣      ┫ 9/30.0k [00:09<09:50:16, 1s/it]
[1AΔETS: 121.567 -- Δproduct: 654.654  0.0%┣     ┫ 10/30.0k [00:10<09:36:13, 1s/it]
[1AΔETS: 100.754 -- Δproduct: 654.654  0.0%┣     ┫ 11/30.0k [00:11<09:18:49, 1s/it]
[1AΔETS: 82.446 -- Δproduct: 654.654  0.0%┣      ┫ 12/30.0k [00:12<09:08:29, 1s/it]
[1AΔETS: 66.469 -- Δproduct: 654.654  0.0%┣      ┫ 13/30.0k [00:13<09:05:58, 1s/it]
[1AΔETS: 52.674 -- Δproduct: 654.654  0.0%┣      ┫ 14/30.0k [00:14<09:06:06, 1s/it]
[1AΔETS: 40.926 -- Δproduct: 654.654  0.1%┣      ┫ 15/30.0k [00:15<09:01:47, 1s/it]
[1AΔETS: 31.084 -- Δproduct: 654.654  0.1%┣      ┫ 16/30.0k [00:16<09:01:37, 1s/it]
[1AΔETS: 23.732 -- Δproduct: 654.654  0.1%┣      ┫ 17/30.0k [00:17<08:51:52, 1s/it]
[1AΔETS: 18.193 -- Δproduct: 654.654  0.1%┣      ┫ 18/30.0k [00:18<08:50:02, 1s/it]
[1AΔETS: 13.991 -- Δproduct: 654.654  0.1%┣      ┫ 19/30.0k [00:19<08:37:39, 1s/it]
[1AΔETS: 10.787 -- Δproduct: 654.654  0.1%┣      ┫ 20/30.0k [00:20<08:35:03, 1s/it]
[1AΔETS: 8.335 -- Δproduct: 654.654  0.1%┣       ┫ 21/30.0k [00:21<08:36:32, 1s/it]
[1AΔETS: 6.451 -- Δproduct: 654.654  0.1%┣       ┫ 22/30.0k [00:21<08:27:32, 1s/it]
[1AΔETS: 5.001 -- Δproduct: 605.124  0.1%┣       ┫ 23/30.0k [00:22<08:20:40, 1s/it]
[1AΔETS: 3.882 -- Δproduct: 504.987  0.1%┣       ┫ 24/30.0k [00:23<08:18:44, 1it/s]
[1AΔETS: 3.017 -- Δproduct: 374.380  0.1%┣       ┫ 25/30.0k [00:24<08:13:21, 1it/s]
[1AΔETS: 2.348 -- Δproduct: 225.751  0.1%┣       ┫ 26/30.0k [00:24<08:06:57, 1it/s]
[1AΔETS: 1.828 -- Δproduct: 74.640  0.1%┣        ┫ 27/30.0k [00:25<08:02:03, 1it/s]
[1AΔETS: 1.385 -- Δproduct: 4.373  0.1%┣         ┫ 28/30.0k [00:26<08:02:14, 1it/s]
[1AΔETS: 1.050 -- Δproduct: 12.315  0.1%┣        ┫ 29/30.0k [00:27<08:00:24, 1it/s]
[1AΔETS: 0.797 -- Δproduct: 18.201  0.1%┣        ┫ 30/30.0k [00:28<07:59:25, 1it/s]
[1AΔETS: 0.605 -- Δproduct: 21.091  0.1%┣        ┫ 31/30.0k [00:29<07:58:39, 1it/s]
[1AΔETS: 0.460 -- Δproduct: 21.294  0.1%┣        ┫ 32/30.0k [00:29<07:52:12, 1it/s]
[1AΔETS: 0.350 -- Δproduct: 19.119  0.1%┣        ┫ 33/30.0k [00:30<07:52:23, 1it/s]
[1AΔETS: 0.266 -- Δproduct: 15.467  0.1%┣        ┫ 34/30.0k [00:31<07:48:54, 1it/s]
[1AΔETS: 0.203 -- Δproduct: 10.999  0.1%┣        ┫ 35/30.0k [00:32<07:45:12, 1it/s]
[1AΔETS: 0.155 -- Δproduct: 6.078  0.1%┣         ┫ 36/30.0k [00:32<07:41:12, 1it/s]
[1AΔETS: 0.118 -- Δproduct: 1.208  0.1%┣         ┫ 37/30.0k [00:33<07:36:45, 1it/s]
[1AΔETS: 0.090 -- Δproduct: 0.319  0.1%┣         ┫ 38/30.0k [00:34<07:34:19, 1it/s]
[1AΔETS: 0.069 -- Δproduct: 0.559  0.1%┣         ┫ 39/30.0k [00:34<07:30:54, 1it/s]
[1AΔETS: 0.053 -- Δproduct: 0.732  0.1%┣         ┫ 40/30.0k [00:35<07:34:00, 1it/s]
[1AΔETS: 0.053 -- Δproduct: 0.732  100.0%┣█████┫ 30.0k/30.0k [00:35<00:00, 846it/s]
ERROR: LoadError: SystemError: opening file "results/rolling_horizon_stochastic_4.csv": No such file or directory
Stacktrace:
  [1] systemerror(p::String, errno::Int32; extrainfo::Nothing)
    @ Base ./error.jl:176
  [2] #systemerror#80
    @ ./error.jl:175 [inlined]
  [3] systemerror
    @ ./error.jl:175 [inlined]
  [4] open(fname::String; lock::Bool, read::Nothing, write::Nothing, create::Nothing, truncate::Bool, append::Nothing)
    @ Base ./iostream.jl:293
  [5] open(fname::String, mode::String; lock::Bool)
    @ Base ./iostream.jl:356
  [6] open(fname::String, mode::String)
    @ Base ./iostream.jl:355
  [7] with(f::CSV.var"#103#104"{Bool, Bool, Tables.Schema{(:Y, :λ_ets_min, :λ_ets_Q1, :λ_ets_mean, :λ_ets_Q3, :λ_ets_max, :λ_product_min, :λ_product_Q1, :λ_product_mean, :λ_product_Q3, :λ_product_max, Symbol("BF-BOF_b_min"), Symbol("BF-BOF_b_Q1"), Symbol("BF-BOF_b_mean"), Symbol("BF-BOF_b_Q3"), Symbol("BF-BOF_b_max"), Symbol("BF-BOF_cap"), Symbol("BF-BOF_g_min"), Symbol("BF-BOF_g_Q1"), Symbol("BF-BOF_g_mean"), Symbol("BF-BOF_g_Q3"), Symbol("BF-BOF_g_max"), Symbol("BF-BOF_bank_min"), Symbol("BF-BOF_bank_Q1"), Symbol("BF-BOF_bank_mean"), Symbol("BF-BOF_bank_Q3"), Symbol("BF-BOF_bank_max"), Symbol("BF-BOF_netto_emiss_min"), Symbol("BF-BOF_netto_emiss_Q1"), Symbol("BF-BOF_netto_emiss_mean"), Symbol("BF-BOF_netto_emiss_Q3"), Symbol("BF-BOF_netto_emiss_max"), Symbol("BF-BlendH2-BOF_b_min"), Symbol("BF-BlendH2-BOF_b_Q1"), Symbol("BF-BlendH2-BOF_b_mean"), Symbol("BF-BlendH2-BOF_b_Q3"), Symbol("BF-BlendH2-BOF_b_max"), Symbol("BF-BlendH2-BOF_cap"), Symbol("BF-BlendH2-BOF_g_min"), Symbol("BF-BlendH2-BOF_g_Q1"), Symbol("BF-BlendH2-BOF_g_mean"), Symbol("BF-BlendH2-BOF_g_Q3"), Symbol("BF-BlendH2-BOF_g_max"), Symbol("BF-BlendH2-BOF_bank_min"), Symbol("BF-BlendH2-BOF_bank_Q1"), Symbol("BF-BlendH2-BOF_bank_mean"), Symbol("BF-BlendH2-BOF_bank_Q3"), Symbol("BF-BlendH2-BOF_bank_max"), Symbol("BF-BlendH2-BOF_netto_emiss_min"), Symbol("BF-BlendH2-BOF_netto_emiss_Q1"), Symbol("BF-BlendH2-BOF_netto_emiss_mean"), Symbol("BF-BlendH2-BOF_netto_emiss_Q3"), Symbol("BF-BlendH2-BOF_netto_emiss_max"), Symbol("HDRI-EAF_b_min"), Symbol("HDRI-EAF_b_Q1"), Symbol("HDRI-EAF_b_mean"), Symbol("HDRI-EAF_b_Q3"), Symbol("HDRI-EAF_b_max"), Symbol("HDRI-EAF_cap"), Symbol("HDRI-EAF_g_min"), Symbol("HDRI-EAF_g_Q1"), Symbol("HDRI-EAF_g_mean"), Symbol("HDRI-EAF_g_Q3"), Symbol("HDRI-EAF_g_max"), Symbol("HDRI-EAF_bank_min"), Symbol("HDRI-EAF_bank_Q1"), Symbol("HDRI-EAF_bank_mean"), Symbol("HDRI-EAF_bank_Q3"), Symbol("HDRI-EAF_bank_max"), Symbol("HDRI-EAF_netto_emiss_min"), Symbol("HDRI-EAF_netto_emiss_Q1"), Symbol("HDRI-EAF_netto_emiss_mean"), Symbol("HDRI-EAF_netto_emiss_Q3"), Symbol("HDRI-EAF_netto_emiss_max"), Symbol("BF-BlendNG-BOF_b_min"), Symbol("BF-BlendNG-BOF_b_Q1"), Symbol("BF-BlendNG-BOF_b_mean"), Symbol("BF-BlendNG-BOF_b_Q3"), Symbol("BF-BlendNG-BOF_b_max"), Symbol("BF-BlendNG-BOF_cap"), Symbol("BF-BlendNG-BOF_g_min"), Symbol("BF-BlendNG-BOF_g_Q1"), Symbol("BF-BlendNG-BOF_g_mean"), Symbol("BF-BlendNG-BOF_g_Q3"), Symbol("BF-BlendNG-BOF_g_max"), Symbol("BF-BlendNG-BOF_bank_min"), Symbol("BF-BlendNG-BOF_bank_Q1"), Symbol("BF-BlendNG-BOF_bank_mean"), Symbol("BF-BlendNG-BOF_bank_Q3"), Symbol("BF-BlendNG-BOF_bank_max"), Symbol("BF-BlendNG-BOF_netto_emiss_min"), Symbol("BF-BlendNG-BOF_netto_emiss_Q1"), Symbol("BF-BlendNG-BOF_netto_emiss_mean"), Symbol("BF-BlendNG-BOF_netto_emiss_Q3"), Symbol("BF-BlendNG-BOF_netto_emiss_max"), :fringe_b_min, :fringe_b_Q1, :fringe_b_mean, :fringe_b_Q3, :fringe_b_max, :fringe_g_min, :fringe_g_Q1, :fringe_g_mean, :fringe_g_Q3, :fringe_g_max, :fringe_bank_min, :fringe_bank_Q1, :fringe_bank_mean, :fringe_bank_Q3, :fringe_bank_max, :fringe_netto_emiss_min, :fringe_netto_emiss_Q1, :fringe_netto_emiss_mean, :fringe_netto_emiss_Q3, :fringe_netto_emiss_max), Tuple{Int64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64, Float64}}, DataFrames.DataFrameRows{DataFrame}, CSV.Options{UInt8, UInt8, Nothing, Tuple{}, typeof(CSV._identity)}, Vector{UInt8}, Int64, Int64, NTuple{115, Symbol}}, io::Any, append::Bool, compress::Bool)
    @ CSV ~/.julia/packages/CSV/b8ebJ/src/write.jl:286
  [8] #write#102
    @ ~/.julia/packages/CSV/b8ebJ/src/write.jl:215 [inlined]
  [9] write(file::String, itr::DataFrame; append::Bool, compress::Bool, writeheader::Nothing, partition::Bool, kw::Base.Pairs{Symbol, Union{}, Tuple{}, NamedTuple{(), Tuple{}}})
    @ CSV ~/.julia/packages/CSV/b8ebJ/src/write.jl:199
 [10] write(file::String, itr::DataFrame)
    @ CSV ~/.julia/packages/CSV/b8ebJ/src/write.jl:162
 [11] top-level scope
    @ /vsc-hard-mounts/leuven-data/351/vsc35199/GreenIndustrialProduction/demos/rollingHorizonStochastic.jl:56
in expression starting at /vsc-hard-mounts/leuven-data/351/vsc35199/GreenIndustrialProduction/demos/rollingHorizonStochastic.jl:37
srun: error: r26i13n03: task 0: Exited with exit code 1
